"""Напишите программу, которая принимает на вход координаты точки (X и Y),
причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

*Пример:*

- x=34; y=-30 -> 4
- x=2; y=4-> 1
- x=-34; y=-30 -> 3"""

x = int(input('Введите значение точки по оси Х: '))
y = int(input('Введите значение точки по оси Y: '))

if x > 0 and y > 0:
    print(f'Точка с кординатами X={x} и Y={y} находится в первой плоскости')
elif x < 0 < y:
    print(f'Точка с кординатами X={x} и Y={y} находится во второй плоскости')
elif x < 0 and y < 0:
    print(f'Точка с кординатами X={x} и Y={y} находится в третьей плоскости')
elif x > 0 > y:
    print(f'Точка с кординатами X={x} и Y={y} находится в четвертой плоскости')
elif x == 0 and y != 0:
    print('Точка находится на оси Y')
elif y == 0 and x != 0:
    print('Точка находится на оси X')
else:
    print('Ошибка')
